------------------------------------------------------------------------------------
       log:  /Users/sechilds/uottawa/log/.log
  log type:  text
 opened on:   7 Apr 2011, 12:46:24

.         
. ensuredir "estimates/"

Running $Id: ensuredir.ado 1394 2010-01-27 14:50:32Z mesa $
Directory estimates/ already exists.

. ensuredir "estimates/`dofilename'/"

Running $Id: ensuredir.ado 1394 2010-01-27 14:50:32Z mesa $
Directory estimates// already exists.

. // ensuredir "estimates/`dofilename'/test_model/"
. 
. ensuredir "output/"

Running $Id: ensuredir.ado 1394 2010-01-27 14:50:32Z mesa $
Directory output/ already exists.

. ensuredir "output/`dofilename'/"

Running $Id: ensuredir.ado 1394 2010-01-27 14:50:32Z mesa $
Directory output// already exists.

. 
. 
. local delimiter=`"`=char(9)'"'          /* " */

. 
. local count = 1 // One version file.

. local datafile1 "${workdatapath}new_variable_data"

. local nick1 "main"

. 
. capture file close modelsfile

. file open modelsfile using "do/persistence_model2_modellist.txt", read text

. 
. file read modelsfile line

. 
. local mcount = 0

. 
. while r(eof)==0 { 
  2.         if substr( "`line'",1,1)=="#" { 
  3.                 local comment = substr( "`line'",2,.)
  4.                 display as text "Comment: " as result "`comment'"
  5.         } 
  6.         else { 
  7.                 tokenize `"`macval(line)'"', parse(`"`delimiter'"') /* " */
  8.                 if "`1'"!="" { 
  9.                         // ensuredir "estimates/`dofilename'/`3'/"
.                         // ensuredir "output/`dofilename'/`3'/"
.                         
.                         local ++mcount
 10.                         
.                         local modelfile`mcount' "`1'"
 11.                         local modelnick`mcount' "`3'"
 12.                         local modelname`mcount' "`5'"
 13.                 } 
 14.         } 
 15.         file read modelsfile line
 16. } 
Comment: persistence_model2_modellist.txt

. file close modelsfile

. 
. forvalues i = 1/`count' { 
  2.         use "`datafile`i''", clear
  3.         
.         ensuredir "estimates/`dofilename'/`nick`i''/"
  4.         ensuredir "output/`dofilename'/`nick`i''/"
  5.         
.         forvalues m = 1/`mcount' { 
  6.                 ensuredir "estimates/`dofilename'/`nick`i''/`modelnick`m''/"
  7.                 ensuredir "output/`dofilename'/`nick`i''/`modelnick`m''/"
  8.                 local myreplace "replace"
  9.                 local sysdate = c(current_date)
 10.                 local systime = c(current_time)
 11.                 local timestring "`sysdate' `systime'"
 12.                 persistence_model using "`modelfile`m''", ///
>                         estdir( "estimates/`dofilename'/`nick`i''/`modelnick`m''/"
> ) ///
>                         title( "Regression Output: `modelname`m''") ///
>                         notes( Average marginal effects shown., Data file: `datafi
> le`i'' (`nick`i''), Do file: `dofilename'.do; Model file: `modelfile`m''; Date ran
> : `timestring' ) ///
>                         sheet( "`modelnick`m''_`n'") ///
>                         save( "output/`dofilename'/`nick`i''/`modelnick`m''/${dofi
> lename}_`nick`i''_`modelnick`m''.xls") `myreplace'
 13.                 local myreplace "append" 
 14.         }       
 15. } 

Running $Id: ensuredir.ado 1394 2010-01-27 14:50:32Z mesa $
Directory estimates//main/ already exists.

Running $Id: ensuredir.ado 1394 2010-01-27 14:50:32Z mesa $
Directory output//main/ already exists.

Running $Id: ensuredir.ado 1394 2010-01-27 14:50:32Z mesa $
Directory estimates//main/base_leave2/ created.

Running $Id: ensuredir.ado 1394 2010-01-27 14:50:32Z mesa $
Directory output//main/base_leave2/ already exists.
Comment: persistence_model2_reg1_leave2.txt
Comment: First set of models - uottawa persistence - Leave in second year.
{ required
r(100);

end of do-file

r(100);

. log close
       log:  /Users/sechilds/uottawa/log/.log
  log type:  text
 closed on:   7 Apr 2011, 12:46:30
------------------------------------------------------------------------------------
